app/Controllers/Profile.php

    public function index()
    {
        $model = new ProfileModel();
        $data['users'] = $model->findAll();
---
SELECT *
FROM `users`